{
  "entries": [
    {
      "date": "2019-12-12",
      "concepts": "Custom Event Listeners",
      "textArea": "I learned about coupling and decoupling. I learned how to create a Custom Event for best practices. By using a Custom Event and creating an event hub, components never talk directly to each other, meaning to each other they don't exist. They communicate directly through the event hub. Since the only thing they have in common is the event hub, changes can be made to each one without breaking the code. Each component only listens to what it wants to listen to.",
      "mood": "Happy",
      "id": 1
    },
    {
      "date": "2019-12-16",
      "concepts": "Group Project",
      "textArea": "Today we start a group project. We are going to build an application for a user to create a traveling itinerary using the skills we have learned so far. ",
      "mood": "Excited",
      "id": 2
    },
    {
      "date": "2019-12-17",
      "concepts": "External API's",
      "textArea": "Continuing group project, I learned how to grab data from an external API. With that data i populated my dropdown menu.",
      "mood": "Happy",
      "id": 3
    },
    {
      "date": "2019-12-18",
      "concepts": "Group Project",
      "textArea": "Yesterday was great! I added an custom event listener to my drop down and i listened for a click on the save Itinerary button that will save the new Itinerary to my local API. But today has been a little challenging trying to figure out how to get the data from the json to populate in the aside view. It's a little challenging but i will conquer! Besides that the NPS API went down, so i learned how to create dummy data to keep the workflow going.",
      "mood": "Content",
      "id": 4
    },
    {
      "date": "2019-12-19",
      "concepts": "Group Project",
      "textArea": "Yesterday i learned that communication is key! I feel that as a group we wasted alot of time working on the same feature. The good thing is we got it working, so i learned how to save information to my local json and also post that information to the aside section of the website. Today i plan to take on the weather API so that when i choose a specific state park it show the current weather for that park.",
      "mood": "Content",
      "id": 5
    }
  ]
}